app/controllers/movies_controller.rb

  def index
    @all_ratings = ['G', 'PG', 'PG-13', 'R']

    if params[:ratings]
      @movies = Movie.where(rating: params[:ratings].keys)
   end
    #@movies = Movie.all
      case params[:sort]
    when 'title'
      @movies = Movie.order('title ASC')
      @title_hilite = 'hilite'
    when 'release'
      @movies = Movie.order('release_date ASC')
      @release_hilite = 'hilite'
    else
      #@movies = Movie.all
      params[:ratings] ? @movies = Movie.where(rating: params[:ratings].keys) :
                         @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')
SELECT "movies".* FROM "movies"  ORDER BY title ASC
SELECT "movies".* FROM "movies"  ORDER BY release_date ASC
SELECT "movies".* FROM "movies"